/* 
Занятие 2. Реляционые базы данных.
Задание 2.5.
*/

- Suppliers -> Products — один-ко-многим.
- Categories -> Products — один-ко-многим.
- Products -> Order Details — один-ко-многим.
- Orders -> Order Details — один-ко-многим.
- Orders (через Order Details) Products — многие-ко-многим. Один заказ может содержать много товаров.
  Один товар может встречаться во многих заказах. Поэтому для реализации связи нужна промежуточная таблица Order Details.
- Employees -> Orders — один-ко-многим.
- Employees -> EmployeeTerritories — один-ко-многим.
- Territories -> EmployeeTerritories — один-ко-многим.
- Employees (через EmployeeTerritories) Territories — многие-ко-многим. Один сотрудник может отвечать за несколько территорий.
  На одной территории может работать несколько сотрудников. Поэтому для реализации связи нужна промежуточная таблица EmployeeTerritories.
- Region -> Territories — один-ко-многим.
- Shippers -> Orders — один-ко-многим.
- Customers -> Orders — один-ко-многим.
- Customers -> CustomerCustomerDemo — один-ко-многим.
- CustomerDemographics -> CustomerCustomerDemo — один-ко-многим.
- Customers (через CustomerCustomerDemo) CustomerDemographics — многие-ко-многим. Один покупатель может входить в несколько 
  демографических групп/категорий. Одна демографическая группа/категория может объединять несколько различных клиентов.
  Поэтому для реализации связи нужна промежуточная таблица CustomerCustomerDemo.
- Employees -> Employees — один-ко-многим: один сотрудник-руководитель может иметь много подчиненных (при условии, что
  я правильно понял, что поле ReportsTo ссылается на EmployeeID этой же таблицы).

/*  
Рефлексия:
Задание: по каждой из таблиц напишите одной строчкой её предполагаемое назначение.
  
Основное различие заключается в формулировках: я описывал, что таблица делает (использовал глаголы), 
а в эталонном решении — какие данные она хранит (использованы существительные).
Где я ошибся:
1) Categories. Упустил момент, что таблица хранит не только названия категорий, но и их описания.
2) Contacts. Мое описание слишком общее ("все лица"), в эталонном перечислены категории из самой таблицы: 
клиенты/заказчики, сотрудники и поставщики.
3) Region, Territories, EmployeeTerritories. В описании использовал глаголы "группирует", "распределяет" 
вместо того, чтобы просто указать содержимое таблицы.
*/
